In [1]:
import csv
import pandas

data = [
    ['StudentID','Name','Marks'],
    [101,'Alice',85],
    [102,'Bob',90],
    [103,'Charlie',88],
    [104,'David',92],
]

file_path = 'example.csv'


with open(file_path, 'w', newline='') as csv_file:
    writer = csv.writer(csv_file)
    writer.writerows(data)

print(f"CSV file '{file_path}' created successfully.")
file_path

CSV file 'example.csv' created successfully.

'example.csv'

In [2]:
examplee = pandas.read_csv(r'C:\Users\SHANTHI GURJAR\example.csv')

In [3]:
import csv
import pandas

dataa = [
    ['StudentID','Age','Grade'],
    [101,20,'A'],
    [102,21,'B'],
    [103,22,'A'],
    [105,19,'C']
]

file_path = 'details.csv'

# Writing the data to CSV
with open(file_path, 'w', newline='') as csv_file:
    writer = csv.writer(csv_file)
    writer.writerows(dataa)

print(f"CSV file '{file_path}' created successfully.")
file_path

CSV file 'details.csv' created successfully.

'details.csv'

In [4]:
details = pandas.read_csv(r'C:\Users\SHANTHI GURJAR\details.csv')

In [5]:
examplee

   StudentID     Name  Marks
0        101    Alice     85
1        102      Bob     90
2        103  Charlie     88
3        104    David     92

In [6]:
details

   StudentID  Age Grade
0        101   20     A
1        102   21     B
2        103   22     A
3        105   19     C

In [7]:
pandas.DataFrame(examplee)

   StudentID     Name  Marks
0        101    Alice     85
1        102      Bob     90
2        103  Charlie     88
3        104    David     92

In [8]:
pandas.DataFrame(details)

   StudentID  Age Grade
0        101   20     A
1        102   21     B
2        103   22     A
3        105   19     C

In [9]:
merged_drama = pandas.merge(examplee,details,on=('StudentID'),how='inner')

In [10]:
merged_drama

   StudentID     Name  Marks  Age Grade
0        101    Alice     85   20     A
1        102      Bob     90   21     B
2        103  Charlie     88   22     A

In [20]:
merged_drama1 = pandas.merge(examplee,details,on=('StudentID'),how='outer')

In [23]:
merged_drama1

   StudentID     Name  Marks   Age Grade
0        101    Alice   85.0  20.0     A
1        102      Bob   90.0  21.0     B
2        103  Charlie   88.0  22.0     A
3        104    David   92.0   NaN   NaN
4        105      NaN    NaN  19.0     C

In [25]:
merged_drama2 = pandas.merge(examplee,details,on=('StudentID'),how='left')

In [17]:
merged_drama2

   StudentID     Name  Marks   Age Grade
0        101    Alice     85  20.0     A
1        102      Bob     90  21.0     B
2        103  Charlie     88  22.0     A
3        104    David     92   NaN   NaN

In [19]:
merged_drama3 = pandas.merge(examplee,details,on=('StudentID'),how='right')

In [23]:
merged_drama3

   StudentID     Name  Marks  Age Grade
0        101    Alice   85.0   20     A
1        102      Bob   90.0   21     B
2        103  Charlie   88.0   22     A
3        105      NaN    NaN   19     C

In [31]:
merged_drama.set_index('StudentID',inplace = True)

In [33]:
merged_drama

              Name  Marks  Age Grade
StudentID
101          Alice     85   20     A
102            Bob     90   21     B
103        Charlie     88   22     A

In [35]:
merged_drama.reset_index('StudentID',inplace=True)

In [37]:
merged_drama

   StudentID     Name  Marks  Age Grade
0        101    Alice     85   20     A
1        102      Bob     90   21     B
2        103  Charlie     88   22     A

In [27]:
file_path = 'merged_drama1.csv'


with open(file_path, 'w', newline='') as csv_file:
    writer = csv.writer(csv_file)
    

print(f"CSV file '{file_path}' created successfully.")
file_path

CSV file 'merged_drama1.csv' created successfully.

'merged_drama1.csv'

In [33]:
merged_drama1

   StudentID     Name  Marks   Age Grade
0        101    Alice   85.0  20.0     A
1        102      Bob   90.0  21.0     B
2        103  Charlie   88.0  22.0     A
3        104    David   92.0   NaN   NaN
4        105      NaN    NaN  19.0     C